# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

month = int(input("Insert month - "))
months = list(range(13))
print(months)
seasons = {зима: [2,12,1], весна: [3,5,4], лето: [6,7,8], осень: [10,9,11]}
for seasons.values() in seasons:
    if i == [x] in seasons.values()
# print(seasons.keys())
# seasons.values()
