# Реализовать функцию my_func(), которая принимает три позиционных аргумента,
# и возвращает сумму наибольших двух аргументов.
# nedodelano
def my_func(a, b, c):
        return min(a, b, c)

print(my_func(input("Insert 1.arg: "), input("Insert 2.arg: "), input("Insert 3.arg: ")))